pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr2672.h
sfr_w(BAKMEM0);                               /* Backup Memory registers. Backup Memory 0. */
sfr_b(BAKMEM0_L);
sfr_b(BAKMEM0_H);
sfr_w(BAKMEM1);                               /* Backup Memory 1. */
sfr_b(BAKMEM1_L);
sfr_b(BAKMEM1_H);
sfr_w(BAKMEM2);                               /* Backup Memory 2. */
sfr_b(BAKMEM2_L);
sfr_b(BAKMEM2_H);
sfr_w(BAKMEM3);                               /* Backup Memory 3. */
sfr_b(BAKMEM3_L);
sfr_b(BAKMEM3_H);
sfr_w(BAKMEM4);                               /* Backup Memory 4. */
sfr_b(BAKMEM4_L);
sfr_b(BAKMEM4_H);
sfr_w(BAKMEM5);                               /* Backup Memory 5. */
sfr_b(BAKMEM5_L);
sfr_b(BAKMEM5_H);
sfr_w(BAKMEM6);                               /* Backup Memory 6. */
sfr_b(BAKMEM6_L);
sfr_b(BAKMEM6_H);
sfr_w(BAKMEM7);                               /* Backup Memory 7. */
sfr_b(BAKMEM7_L);
sfr_b(BAKMEM7_H);
sfr_w(BAKMEM8);                               /* Backup Memory 8. */
sfr_b(BAKMEM8_L);
sfr_b(BAKMEM8_H);
sfr_w(BAKMEM9);                               /* Backup Memory 9. */
sfr_b(BAKMEM9_L);
sfr_b(BAKMEM9_H);
sfr_w(BAKMEM10);                              /* Backup Memory registers. Backup Memory 10. */
sfr_b(BAKMEM10_L);
sfr_b(BAKMEM10_H);
sfr_w(BAKMEM11);                              /* Backup Memory 11. */
sfr_b(BAKMEM11_L);
sfr_b(BAKMEM11_H);
sfr_w(BAKMEM12);                              /* Backup Memory 12. */
sfr_b(BAKMEM12_L);
sfr_b(BAKMEM12_H);
sfr_w(BAKMEM13);                              /* Backup Memory 13. */
sfr_b(BAKMEM13_L);
sfr_b(BAKMEM13_H);
sfr_w(BAKMEM14);                              /* Backup Memory 14. */
sfr_b(BAKMEM14_L);
sfr_b(BAKMEM14_H);
sfr_w(BAKMEM15);                              /* Backup Memory 15. */
sfr_b(BAKMEM15_L);
sfr_b(BAKMEM15_H);

/* BKMEM Register Offsets */
#define OFS_BAKMEM0                      (0x0000)
#define OFS_BAKMEM0_L                    OFS_BAKMEM0
#define OFS_BAKMEM0_H                    OFS_BAKMEM0+1
#define OFS_BAKMEM1                      (0x0002)
#define OFS_BAKMEM1_L                    OFS_BAKMEM1
#define OFS_BAKMEM1_H                    OFS_BAKMEM1+1
#define OFS_BAKMEM2                      (0x0004)
#define OFS_BAKMEM2_L                    OFS_BAKMEM2
#define OFS_BAKMEM2_H                    OFS_BAKMEM2+1
#define OFS_BAKMEM3                      (0x0006)
#define OFS_BAKMEM3_L                    OFS_BAKMEM3
#define OFS_BAKMEM3_H                    OFS_BAKMEM3+1
#define OFS_BAKMEM4                      (0x0008)
#define OFS_BAKMEM4_L                    OFS_BAKMEM4
#define OFS_BAKMEM4_H                    OFS_BAKMEM4+1
#define OFS_BAKMEM5                      (0x000A)
#define OFS_BAKMEM5_L                    OFS_BAKMEM5
#define OFS_BAKMEM5_H                    OFS_BAKMEM5+1
#define OFS_BAKMEM6                      (0x000C)
#define OFS_BAKMEM6_L                    OFS_BAKMEM6
#define OFS_BAKMEM6_H                    OFS_BAKMEM6+1
#define OFS_BAKMEM7                      (0x000E)
#define OFS_BAKMEM7_L                    OFS_BAKMEM7
#define OFS_BAKMEM7_H                    OFS_BAKMEM7+1
#define OFS_BAKMEM8                      (0x0010)
#define OFS_BAKMEM8_L                    OFS_BAKMEM8
#define OFS_BAKMEM8_H                    OFS_BAKMEM8+1
#define OFS_BAKMEM9                      (0x0012)
#define OFS_BAKMEM9_L                    OFS_BAKMEM9
#define OFS_BAKMEM9_H                    OFS_BAKMEM9+1
#define OFS_BAKMEM10                     (0x0014)
#define OFS_BAKMEM10_L                   OFS_BAKMEM10
#define OFS_BAKMEM10_H                   OFS_BAKMEM10+1
#define OFS_BAKMEM11                     (0x0016)
#define OFS_BAKMEM11_L                   OFS_BAKMEM11
#define OFS_BAKMEM11_H                   OFS_BAKMEM11+1
#define OFS_BAKMEM12                     (0x0018)
#define OFS_BAKMEM12_L                   OFS_BAKMEM12
#define OFS_BAKMEM12_H                   OFS_BAKMEM12+1
#define OFS_BAKMEM13                     (0x001A)
#define OFS_BAKMEM13_L                   OFS_BAKMEM13
#define OFS_BAKMEM13_H                   OFS_BAKMEM13+1
#define OFS_BAKMEM14                     (0x001C)
#define OFS_BAKMEM14_L                   OFS_BAKMEM14
#define OFS_BAKMEM14_H                   OFS_BAKMEM14+1
#define OFS_BAKMEM15                     (0x001E)
#define OFS_BAKMEM15_L                   OFS_BAKMEM15
#define OFS_BAKMEM15_H                   OFS_BAKMEM15+1

/* No control bits available or already defined for another module */

/*****************************************************************************
 CAPTIVATE Registers
*****************************************************************************/

#define __MSP430_HAS_CAPTIVATE__              /* Definition to show that module is available */
#define __MSP430_BASEADDRESS_CAPTIVATE__ 0x0A00
#define CAPTIVATE_BASE         __MSP430_BASEADDRESS_CAPTIVATE__

sfr_w(CAPIE);                                 /* CapTIvate Interrupt Enable Register */
sfr_b(CAPIE_L);
sfr_b(CAPIE_H);
sfr_w(CAPIFG);                                /* CapTIvate Interrupt Flag Register */
sfr_b(CAPIFG_L);
sfr_b(CAPIFG_H);
sfr_w(CAPIV);                                 /* CapTIvate Interrupt Vector Register */
sfr_b(CAPIV_L);
sfr_b(CAPIV_H);

/* CAPTIVATE Register Offsets */
#define OFS_CAPIE                        (0x0120)
#define OFS_CAPIE_L                      OFS_CAPIE
#define OFS_CAPIE_H                      OFS_CAPIE+1
#define OFS_CAPIFG                       (0x0122)
#define OFS_CAPIFG_L                     OFS_CAPIFG
#define OFS_CAPIFG_H                     OFS_CAPIFG+1
#define OFS_CAPIV                        (0x0124)
#define OFS_CAPIV_L                      OFS_CAPIV
#define OFS_CAPIV_H                      OFS_CAPIV+1

/* CAPTIVATE Control Bits */

/* CAPIE Control Bits */
#define EOCIEN                           (0x0001)        /* */
#define EOCIEN_L                         (0x0001)
#define EOCIEN_0                         (0x0000)        /* Interrupt disabled */
#define EOCIEN_1                         (0x0001)        /* Interrupt enabled */
#define EOCIEN_1_L                       (0x0001)
#define CAPDTCTIEN                       (0x0002)        /* */
#define CAPDTCTIEN_L                     (0x0002)
#define CAPDTCTIEN_0                     (0x0000)        /* Interrupt disabled */
#define CAPDTCTIEN_1                     (0x0002)        /* Interrupt enabled */
#define CAPDTCTIEN_1_L                   (0x0002)
#define CAPTIEN                          (0x0004)        /* */
#define CAPTIEN_L                        (0x0004)
#define CAPTIEN_0                        (0x0000)        /* Interrupt disabled */
#define CAPTIEN_1                        (0x0004)        /* Interrupt enabled */
#define CAPTIEN_1_L                      (0x0004)
#define CAPCNTRIEN                       (0x0008)        /* */
#define CAPCNTRIEN_L                     (0x0008)
#define CAPCNTRIEN_0                     (0x0000)        /* Interrupt disabled */
#define CAPCNTRIEN_1                     (0x0008)        /* Interrupt enabled */
#define CAPCNTRIEN_1_L                   (0x0008)
#define CAPMAXIEN                        (0x0100)        /* */
#define CAPMAXIEN_H                      (0x0001)
#define CAPMAXIEN_0                      (0x0000)        /* Interrupt disabled */
#define CAPMAXIEN_1                      (0x0100)        /* Interrupt enabled */
#define CAPMAXIEN_1_H                    (0x0001)

/* CAPIFG Control Bits */
#define EOCIFG                           (0x0001)        /* */
#define EOCIFG_L                         (0x0001)
#define EOCIFG_0                         (0x0000)        /* No end of conversion has occurred */
#define EOCIFG_1                         (0x0001)        /* End of conversion has occurred */
#define EOCIFG_1_L                       (0x0001)
#define CAPDTCTIFG                       (0x0002)        /* */
#define CAPDTCTIFG_L                     (0x0002)
#define CAPDTCTIFG_0                     (0x0000)        /* No interrupt pending */
#define CAPDTCTIFG_1                     (0x0002)        /* Interrupt pending */
#define CAPDTCTIFG_1_L                   (0x0002)
#define CAPTIFG                          (0x0004)        /* */
#define CAPTIFG_L                        (0x0004)
#define CAPTIFG_0                        (0x0000)        /* No interrupt pending */
#define CAPTIFG_1                        (0x0004)        /* Interrupt pending */
#define CAPTIFG_1_L                      (0x0004)
#define CAPCNTRIFG                       (0x0008)        /* */
#define CAPCNTRIFG_L                     (0x0008)
#define CAPCNTRIFG_0                     (0x0000)        /* No interrupt pending */
#define CAPCNTRIFG_1                     (0x0008)        /* Interrupt pending */
#define CAPCNTRIFG_1_L                   (0x0008)
#define CAPMAXIFG                        (0x0100)        /* */
#define CAPMAXIFG_H                      (0x0001)
#define CAPMAXIFG_0                      (0x0000)        /* Maximum count not reached */
#define CAPMAXIFG_1                      (0x0100)        /* Maximum count reached */
#define CAPMAXIFG_1_H                    (0x0001)

/* CAPIV Control Bits */
#define CAPIV0                           (0x0001)        /* CAPIV Bit 0 */
#define CAPIV0_L                         (0x0001)
#define CAPIV1                           (0x0002)        /* CAPIV Bit 1 */
#define CAPIV1_L                         (0x0002)
#define CAPIV2                           (0x0004)        /* CAPIV Bit 2 */
#define CAPIV2_L                         (0x0004)
#define CAPIV3                           (0x0008)        /* CAPIV Bit 3 */
#define CAPIV3_L                         (0x0008)
#define CAPIV4                           (0x0010)        /* CAPIV Bit 4 */
#define CAPIV4_L                         (0x0010)
#define CAPIV5                           (0x0020)        /* CAPIV Bit 5 */
#define CAPIV5_L                         (0x0020)
#define CAPIV6                           (0x0040)        /* CAPIV Bit 6 */
#define CAPIV6_L                         (0x0040)
#define CAPIV7                           (0x0080)        /* CAPIV Bit 7 */
#define CAPIV7_L                         (0x0080)
#define CAPIV8                           (0x0100)        /* CAPIV Bit 8 */
#define CAPIV8_H                         (0x0001)
#define CAPIV9                           (0x0200)        /* CAPIV Bit 9 */
#define CAPIV9_H                         (0x0002)
#define CAPIV10                          (0x0400)        /* CAPIV Bit 10 */
#define CAPIV10_H                        (0x0004)
#define CAPIV11                          (0x0800)        /* CAPIV Bit 11 */
#define CAPIV11_H                        (0x0008)
#define CAPIV12                          (0x1000)        /* CAPIV Bit 12 */
#define CAPIV12_H                        (0x0010)
#define CAPIV13                          (0x2000)        /* CAPIV Bit 13 */
#define CAPIV13_H                        (0x0020)
#define CAPIV14                          (0x4000)        /* CAPIV Bit 14 */
#define CAPIV14_H                        (0x0040)
#define CAPIV15                          (0x8000)        /* CAPIV Bit 15 */
#define CAPIV15_H                        (0x0080)
#define CAPIV_0                          (0x0000)        /* No interrupt pending */
#define CAPIV_2                          (0x0002)        /* Interrupt source: End of conversion interrupt, Flag = EOCIFG */
#define CAPIV_2_L                        (0x0002)
#define CAPIV_4                          (0x0004)        /* Interrupt source: Detection interrupt, Flag = CAPDTCTIFG */
#define CAPIV_4_L                        (0x0004)
#define CAPIV_6                          (0x0006)        /* Interrupt source: CapTIvate Timer interrupt, Flag = CAPTIFG */
#define CAPIV_6_L                        (0x0006)
#define CAPIV_8                          (0x0008)        /* Interrupt source: CapTIvate Counter interrupt, Flag = 
                                                            CAPCNTRIFG */
#define CAPIV_8_L                        (0x0008)
#define CAPIV_10                         (0x000a)        /* Interrupt source: max count value reached, Flag = CAPMAXIFG */
#define CAPIV_10_L                       (0x000a)


/*****************************************************************************
 CRC Registers
*****************************************************************************/

#define __MSP430_HAS_CRC__                    /* Definition to show that module is available */
#define __MSP430_BASEADDRESS_CRC__ 0x01C0
#define CRC_BASE               __MSP430_BASEADDRESS_CRC__

